Classes | Functions
Input Method
Functions related to input methods in Archicad. More...
 Classes
class  | ACAPI::v1::ZoneLabelingSettings
A class that contains functions related to zone labeling by favorite. More...
 Functions
ZoneLabelingSettings  | ACAPI::v1::CreateZoneLabelingSettings ()
A function to create zone labeling settings instance, that lets you query and manipulate zone label favorite related data.
Detailed Description
Functions related to input methods in Archicad.
Functions related to the settings of input methods.
      Input Methods
      ==================================
      Archicad provides various input methods to allow users to interact with the software using their mouse and keyboard. These input methods enable users to perform operations, select elements, navigate the workspace, and execute commands.
      Add-ons can also utilize these input methods to enhance user interaction and extend functionality.
      ## Functions
      The following functions let you manipulate @ref ACAPI::v1::ZoneLabelingSettings
      - @ref ACAPI::v1::ZoneLabelingSettings::IsAutomaticLabelingOn
      - @ref ACAPI::v1::ZoneLabelingSettings::SetAutomaticLabeling
      - @ref ACAPI::v1::ZoneLabelingSettings::GetSelectedFavoriteName
      - @ref ACAPI::v1::ZoneLabelingSettings::SetSelectedFavorite
Function Documentation
◆ CreateZoneLabelingSettings()
 ZoneLabelingSettings ACAPI::v1::CreateZoneLabelingSettings  |  ( |   | )
inline
A function to create zone labeling settings instance, that lets you query and manipulate zone label favorite related data.
Returns
Returns the zone labeling settings instance.